Revit 2027 API
BuiltInFailures.RebarCouplerFailures.LengthParameterError Property
 This is used to post error. The "Total Length" parameter must be set to a strictly positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LengthParameterError { get; }
Public Shared ReadOnly Property LengthParameterError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LengthParameterError {
	FailureDefinitionId^ get ();
}
static member LengthParameterError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace